'''В другому пакунку створити файл з 3 параметризованими тестами, один з яких буде ітеруватись і перевіряти одиничні
значення, другий перевірятиме пари значень, третій перевірятиме будь-які значення на ваш розсуд,
але кожному значенню має бути присвоєний псевдонім. На кожен з тестів має бути застосована одна глобальна фікстура.
На усіх тестах має бути мітка "param"'''

import pytest

@pytest.fixture(scope='function', autouse=True)
def func_fixture():
    print('\nText from fixture before each test')
    yield
    print('\nText from fixture after each test')